app/views/links/show.html.erb

SELECT  1 AS one FROM "visits" WHERE "visits"."link_id" = ? LIMIT 1  [["link_id", 980190963]]
SELECT "visits".* FROM "visits" WHERE "visits"."link_id" = ?  [["link_id", 980190962]]
---

		<% if @link.visits.empty? %>