app/controllers/links_controller.rb

  def create
    @link = if current_user
              current_user.links.new(link_params)
            else
              Link.new(link_params)
            end

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("user_id", "long", "short", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 298486374], ["long", "http://ruby.about.com/"], ["short", "1gT9UA"], ["created_at", "2016-04-01 09:44:37.885073"], ["updated_at", "2016-04-01 09:44:37.885073"]]
UPDATE "users" SET "links_count" = COALESCE("links_count", 0) + 1 WHERE "users"."id" = ?  [["id", 298486374]]

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "short" = ? WHERE "links"."id" = ?  [["short", "L4tYGA"], ["id", 980190962]]

  def destroy
    @link.destroy
---
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 980190962]]