app/controllers/redirect_controller.rb

INSERT INTO "visits" ("link_id", "browser", "ip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["link_id", 980190962], ["browser", "Rails"], ["ip", "0.0.0.0"], ["created_at", "2016-04-05 21:32:32.437841"], ["updated_at", "2016-04-05 21:32:32.437841"]]
---
  def show
    respond_to do |format|
      count = @short.click_count + 1
      @short.update_attributes(click_count: count)
      data = visitor_details(@short.id).to_hash
      Visit.create(data)