app/controllers/visits_controller.rb

SELECT "visits".* FROM "visits"
---
  def index
    @visits = Visit.all

INSERT INTO "visits" ("link_id", "ip", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["link_id", 980190962], ["ip", ":1"], ["created_at", "2016-04-01 09:34:40.711007"], ["updated_at", "2016-04-01 09:34:40.711007"]]
---
  def create
    @visit = Visit.new(visit_params)
    respond_to do |format|
      if @visit.save

DELETE FROM "visits" WHERE "visits"."id" = ?  [["id", 980190962]]
---
  def destroy
    @visit.destroy

SELECT  "visits".* FROM "visits" WHERE "visits"."id" = ? LIMIT 1  [["id", 980190962]]
---
  def set_visit
    @visit = Visit.find(params[:id])